package blackberry.day7OOP1;

/**
 * @author bberzhou@gmail.com
 * @date 8/26/19 20:39
 * Create By IntelliJ IDEA
 */
public class OOPTest {
    /*
        一、Java面向对象学习的三条主线
        1。Java类及类的成员：属性、方法、构造器；(代码块、内部类)
        2。面向对象的三大特征：封装性、继承性、多态性、（抽象性）；
        3。其他关键字：this super,static,abstract,final,interface

        二、区别面向对象和面向过程
        "人把大象装进冰箱
        1。面向过程：强调的是功能行为，以函数为最小的单位，考虑如何去做
            1）把冰箱打开,
            2）抬起大象
            3）装进冰箱
        2。面向对象：强调的是谁来做，强调具备了功能的对象，以类/对象为最小单位，考虑谁来做
            人{
                打开（冰箱）{
                    冰箱.open();
                抬起(大象){
                    大象.进入(冰箱)；
                }
            }

            冰箱{
                    open(){};
                    close(){};
                }

            大象{
                    进入(冰箱);
            }


        三：面向对象的两个要素
            类：对一类事物的描述，是抽象的、概念上的
            对象：是实际存在的该类事物的一个个体，因而也称为实例(instance)
                面向对象程序设计的重点就是设计类
                设计类，就是设计类的成员
     */

}
